# LAB | Connecting Python to SQL

    Introduction
Welcome to the Connecting Python to SQL lab!

In this lab, you will be working with the Sakila database on movie rentals. Specifically, you will be practicing how to do basic SQL queries using Python. By connecting Python to SQL, you can leverage the power of both languages to efficiently manipulate and analyze large datasets. Throughout this lab, you will practice how to use Python to retrieve and manipulate data stored in the Sakila database using SQL queries. Let's get started!

# Challenge

In this lab, the objective is to identify the customers who were active in both May and June, and how did their activity differ between months. To achieve this, follow these steps:

1.- Establish a connection between Python and the Sakila database.

In [18]:
import pandas as pd
import numpy as np

import pymysql
from sqlalchemy import create_engine

from sklearn.metrics import confusion_matrix, accuracy_score, precision_score, recall_score, ConfusionMatrixDisplay
from sklearn.metrics import classification_report, f1_score, cohen_kappa_score

import getpass  # To get the password without showing the input

In [19]:
password = getpass.getpass()

········

In [23]:
def connecting_to_db(url):
    engine = create_engine(url)
    connection = engine.connect()
    return connection

rentals = connecting_to_db('mysql+pymysql://root:'+password+'@localhost/sakila')

2.- Write a Python function called rentals_month that retrieves rental data for a given month and year (passed as parameters) from the Sakila database as a Pandas DataFrame. The function should take in three parameters:

- engine: an object representing the database connection engine to be used to establish a connection to the Sakila database.

- month: an integer representing the month for which rental data is to be retrieved.

- year: an integer representing the year for which rental data is to be retrieved.

The function should execute a SQL query to retrieve the rental data for the specified month and year from the rental table in the Sakila database, and return it as a pandas DataFrame.

In [24]:
"""Python function called rentals_month that retrieves rental data 
for a given month and year

The function should take in three parameters
engine
month 
year 

Should execute a SQL query to retrieve the rental data for the specified month and year
from the rental table in the Sakila database, and return it as a pandas DataFrame
"""

def rentals_month(engine, month, year):
    if not isinstance(month, int):
        raise Exception("Month should be an integer")

    if not isinstance(year, int):
        raise Exception("Year should be an integer")

    query = f"""
        SELECT * from sakila.rental
        where YEAR(rental_date) = {year} AND MONTH(rental_date) = {month}
    """
    result = engine.execute(query)
    result = result.fetchall()
    df = pd.DataFrame(result)
    return df

month = 8
year = 2005
rm_df = rentals_month(rentals, month, year)
rm_df

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,10181,2005-08-01 00:00:44,3111,113,2005-08-04 19:33:44,1,2006-02-15 21:30:53
1,10182,2005-08-01 00:08:01,4112,578,2005-08-09 18:14:01,2,2006-02-15 21:30:53
2,10183,2005-08-01 00:08:01,4319,377,2005-08-09 20:41:01,1,2006-02-15 21:30:53
3,10184,2005-08-01 00:09:33,2785,77,2005-08-05 04:12:33,2,2006-02-15 21:30:53
4,10185,2005-08-01 00:12:11,1266,64,2005-08-03 03:03:11,1,2006-02-15 21:30:53
...,...,...,...,...,...,...,...
5681,16045,2005-08-23 22:25:26,772,14,2005-08-25 23:54:26,1,2006-02-15 21:30:53
5682,16046,2005-08-23 22:26:47,4364,74,2005-08-27 18:02:47,2,2006-02-15 21:30:53
5683,16047,2005-08-23 22:42:48,2088,114,2005-08-25 02:48:48,2,2006-02-15 21:30:53
5684,16048,2005-08-23 22:43:07,2019,103,2005-08-31 21:33:07,1,2006-02-15 21:30:53
5685,16049,2005-08-23 22:50:12,2666,393,2005-08-30 01:01:12,2,2006-02-15 21:30:53

3.- Develop a Python function called rental_count_month that takes the DataFrame provided by rentals_month as input along with the month and year and returns a new DataFrame containing the number of rentals made by each customer_id during the selected month and year.

The function should also include the month and year as parameters and use them to name the new column according to the month and year, for example, if the input month is 05 and the year is 2005, the column name should be "rentals_05_2005".

Hint: Consider making use of pandas groupby()

In [25]:
def rental_count_month(df, month, year):
    df = df.groupby('customer_id', as_index=False).size()
    df.rename(columns = {'size': f'rentals_{month}_{year}'}, inplace = True)
    return df

rdf = rental_count_month(rm_df, month, year)
rdf

     customer_id  rentals_8_2005
0              1              11
1              2              11
2              3               7
3              4              11
4              5              13
..           ...             ...
594          595               8
595          596              13
596          597              12
597          598               5
598          599               7

[599 rows x 2 columns]

4.- Create a Python function called compare_rentals that takes two DataFrames as input containing the number of rentals made by each customer in different months and years. The function should return a combined DataFrame with a new 'difference' column, which is the difference between the number of rentals in the two months.

In [27]:
def compare_rentals(df1, df2):
    merged_df = pd.merge(df1, df2, on="customer_id", how="inner")
    merged_df["difference"] = merged_df.iloc[:, 1] - merged_df.iloc[:, 2]

    return merged_df

df1 = rentals_month(rentals, 7, 2005)
df1 = rental_count_month(df1, 7, 2005)
df2 = rentals_month(rentals, 8, 2005)
df2 = rental_count_month(df2, 8, 2005)
c_df = compare_rentals(df1, df2)
display(df1)
display(df2)
display(c_df)

     customer_id  rentals_7_2005
0              1              12
1              2              14
2              3              13
3              4               5
4              5              16
..           ...             ...
594          595              19
595          596               6
596          597               7
597          598              16
598          599               7

[599 rows x 2 columns]

     customer_id  rentals_8_2005
0              1              11
1              2              11
2              3               7
3              4              11
4              5              13
..           ...             ...
594          595               8
595          596              13
596          597              12
597          598               5
598          599               7

[599 rows x 2 columns]

     customer_id  rentals_7_2005  rentals_8_2005  difference
0              1              12              11           1
1              2              14              11           3
2              3              13               7           6
3              4               5              11          -6
4              5              16              13           3
..           ...             ...             ...         ...
594          595              19               8          11
595          596               6              13          -7
596          597               7              12          -5
597          598              16               5          11
598          599               7               7           0

[599 rows x 4 columns]